{
  "meta": {
    "language": "en-GB"
  },
  "basics": {
    "name": "Edd Mann",
    "label": "Software Engineer",
    "image": "https://eddmann.com/assets/avatar.jpg",
    "email": "the@eddmann.com",
    "url": "https://eddmann.com",
    "summary": "Tech Lead and software engineer with 15+ years building scalable systems using DDD, event-sourcing, AWS (Serverless), and event-driven architectures. Full-stack skills include React, PHP, TypeScript, and Terraform. Passionate about solving business problems, continuous learning aided by side-projects, and sharing knowledge through writing and podcasting.",
    "location": {
      "city": "London",
      "region": "England",
      "countryCode": "GB"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "eddmann",
        "url": "https://github.com/eddmann"
      },
      {
        "network": "LinkedIn",
        "username": "eddmann",
        "url": "https://www.linkedin.com/in/eddmann/"
      },
      {
        "network": "X",
        "username": "edd_mann",
        "url": "https://x.com/edd_mann"
      },
      {
        "network": "Bluesky",
        "username": "eddmann.com",
        "url": "https://bsky.app/profile/eddmann.com"
      }
    ]
  },
  "work": [
    {
      "name": "Instapro",
      "position": "Tech Lead",
      "url": "https://careers.instapro.group/",
      "startDate": "2022",
      "endDate": "2025",
      "summary": "Promoted to Tech Lead after the MyBuilder and Instapro merger, shaping technical direction and leading key greenfield projects in a larger organisation.",
      "highlights": [
        "Led a major retailer integration service, running event storming sessions and collaborating with stakeholders from design to rollout. Delivered using React, TypeScript, PHP, and AWS Serverless.",
        "Built a chat platform as a micro-frontend vertical-slice service, enabling rapid delivery and experimentation with custom markup, Slack-like features, and an internal 'Surface Builder' tooling.",
        "Drove architectural decisions and guided teams in breaking up the monolith, adopting vertical-slice service ownership, and designing around subdomains and bounded contexts."
      ]
    },
    {
      "name": "MyBuilder",
      "position": "Site Reliability Engineer",
      "url": "https://www.mybuilder.com/",
      "startDate": "2019",
      "endDate": "2022",
      "summary": "Transitioned to a Site Reliability Engineer role to focus on cloud-native infrastructure and platform enablement, supporting development teams and contributing to architectural decisions.",
      "highlights": [
        "Led the development of a greenfield insurance application and underwriting system (MyBuilder Plus), delivered in under six months using DDD, Event Sourcing, CQRS, Hexagonal Architecture, Terraform, and Serverless technologies.",
        "Migrated all services to Serverless (AWS Lambda), reducing operational overhead, empowering teams to focus on business value, and accelerating delivery.",
        "Created internal developer tooling, including a CLI to streamline service discovery and local development, significantly improving developer productivity."
      ]
    },
    {
      "name": "MyBuilder",
      "position": "Senior Software Engineer",
      "url": "https://www.mybuilder.com/",
      "startDate": "2016",
      "endDate": "2019",
      "summary": "Promoted to Senior Software Engineer, leading major product features, mentoring junior engineers, and shaping infrastructure strategy.",
      "highlights": [
        "Led migration from on-premises to AWS using Terraform and many AWS services.",
        "Built an event-sourced Tradespeople shortlist billing bounded context within the modular monolith."
      ]
    },
    {
      "name": "MyBuilder",
      "position": "Software Engineer",
      "url": "https://www.mybuilder.com/",
      "startDate": "2014",
      "endDate": "2016",
      "summary": "Worked in a small, agile team applying modern engineering practices across the stack. Delivered both greenfield and brownfield projects, deepening my technical and business domain expertise.",
      "highlights": [
        "Drove key product features that contributed to MyBuilder's acquisition by IAC in 2017.",
        "Supported the migration to a modular monolith architecture, helping discover subdomains and architect bounded contexts.",
        "Built a greenfield RESTful microservice for Tradespeople trade assessments, ensuring qualification standards on the platform."
      ]
    },
    {
      "name": "360 Software Solutions",
      "position": "Web Developer",
      "url": "https://www.360ss.com/",
      "startDate": "2011",
      "endDate": "2013",
      "summary": "Delivered tailored web solutions for diverse clients, balancing new and legacy projects while honing communication and problem-solving skills.",
      "highlights": [
        "Designed and implemented a modular MVC PHP content management platform, enabling rapid and efficient client website development.",
        "Led the end-to-end development of a large-scale, web-based mobile search engine start-up, overseeing architecture and delivery.",
        "Developed and launched a cross-platform mobile application for iOS and Android using Titanium, expanding client reach."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Greenwich",
      "url": "https://www.gre.ac.uk/",
      "area": "Internet Computing",
      "studyType": "Bachelor of Science",
      "startDate": "2008",
      "endDate": "2011",
      "score": "First Class Honours"
    },
    {
      "institution": "West Kent College",
      "url": "https://www.northkent.ac.uk/",
      "area": "IT Practitioner",
      "studyType": "BTEC National Diploma",
      "startDate": "2005",
      "endDate": "2007",
      "score": "Distinction, Distinction, Merit"
    }
  ],
  "awards": [
    {
      "title": "School Prize for Outstanding Achievement (Computing)",
      "date": "2011",
      "awarder": "University of Greenwich",
      "url": "https://www.gre.ac.uk/",
      "summary": "Awarded the School Prize for Outstanding Achievement in the Undergraduate Computing programme, achieving 74%+ in every module across all three years."
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "keywords": [
        "PHP",
        "JavaScript",
        "TypeScript",
        "Python",
        "Rust",
        "Swift",
        "SQL"
      ]
    },
    {
      "name": "Frontend",
      "keywords": [
        "React",
        "Next.js",
        "Redux Toolkit",
        "Vite",
        "BEM",
        "Tailwind CSS",
        "Styled Components",
        "PWA (Service Workers, Workbox)",
        "WebAssembly"
      ]
    },
    {
      "name": "Backend",
      "keywords": ["Symfony", "Laravel"]
    },
    {
      "name": "Cloud & Infrastructure",
      "keywords": [
        "AWS",
        "Terraform",
        "Serverless Framework",
        "CDK",
        "AWS Lambda",
        "S3",
        "EventBridge",
        "SQS",
        "SNS",
        "RDS",
        "ECS Fargate"
      ]
    },
    {
      "name": "Databases",
      "keywords": ["PostgreSQL", "MySQL", "Redis", "DynamoDB"]
    },
    {
      "name": "Architecture & Practices",
      "keywords": [
        "Domain-Driven Design",
        "Event Sourcing",
        "CQRS",
        "Hexagonal Architecture",
        "Event-driven Architecture",
        "Micro-frontends",
        "Microservices"
      ]
    },
    {
      "name": "Tooling & DevOps",
      "keywords": [
        "Git",
        "Unix",
        "Docker",
        "GitHub Actions",
        "Puppet",
        "Terraform Cloud"
      ]
    },
    {
      "name": "Testing & Monitoring",
      "keywords": [
        "Automated testing",
        "Continuous integration",
        "Continuous delivery",
        "AWS CloudWatch",
        "Datadog",
        "Grafana",
        "Sentry"
      ]
    }
  ],
  "projects": [
    {
      "name": "santa-lang",
      "url": "https://eddmann.com/santa-lang/",
      "description": "A functional, C-like programming language for Advent of Code puzzles that blends the most effective features from languages I've worked with, featuring a tree-walking interpreter in TypeScript and Rust."
    },
    {
      "name": "MyPodcast",
      "url": "https://mypodcast.cloud/",
      "description": "A SaaS that turns saved articles into narrated podcast episodes using LLMs for summarisation and text-to-speech, delivered directly to your podcast app."
    },
    {
      "name": "Our Wedding Website",
      "url": "https://github.com/eddmann/our-wedding-website",
      "description": "A serverless PHP/Symfony project demonstrating DDD, Hexagonal Architecture, CQRS, and Event Sourcing, used at MyBuilder and Instapro to teach core architectural patterns with Terraform IaC and robust testing."
    },
    {
      "name": "Serverless Fargate",
      "url": "https://www.npmjs.com/package/serverless-fargate",
      "description": "A Serverless Framework plugin for managing long-running Fargate ECS tasks, averaging over 8,000 weekly downloads on NPM."
    },
    {
      "name": "Chessmate",
      "url": "https://chessmate.cloud/",
      "description": "A multi-engine chess analysis Progressive Web App with online (AWS Lambda) and local (WASM) chess engine support, plus an iOS app available in the App Store."
    },
    {
      "name": "Advent of Code",
      "url": "https://github.com/eddmann/advent-of-code/",
      "description": "Completed (almost) every Advent of Code puzzle in multiple languages to deepen my skills and explore new programming paradigms."
    }
  ],
  "interests": [
    {
      "name": "Podcasting",
      "keywords": [
        "Host of Compiled Conversations, interviewing influential figures in software and technology.",
        "Co-hosted Three Devs and a Maybe (2013-2019), covering a broad range of software topics."
      ]
    },
    {
      "name": "Running",
      "keywords": [
        "Passionate long-distance runner with 20+ marathons and an ultra marathon completed; known for early morning runs and obsessively tracking stats on Strava."
      ]
    },
    {
      "name": "PCB Design",
      "keywords": [
        "Learning PCB design by building a custom electronic chessboard using Chessmate APIs, and documenting the process on my site."
      ]
    },
    {
      "name": "AI & Machine Learning",
      "keywords": [
        "Exploring AI's impact on software development through hands-on projects.",
        "Building predictive models (e.g., fantasy Formula 1 outcomes) to deepen ML expertise.",
        "Using CNNs to detect chessboard states, powering new Chessmate features."
      ]
    }
  ],
  "references": [
    {
      "reference": "Available upon request"
    }
  ]
}
