{
  "basics": {
    "name": "Edd Mann",
    "label": "Software Engineer",
    "image": "https://eddmann.com/assets/avatar.jpg",
    "email": "the@eddmann.com",
    "url": "https://eddmann.com",
    "summary": "Experienced Tech Lead and software engineer with over 15 years of hands-on experience building scalable, robust systems using DDD, modern cloud infrastructure, and event-driven architectures. I thrive on solving real business problems with code and have a passion for continuous learning, whether working in stream-aligned teams or enabling platform roles. I'm an effective communicator who enjoys sharing knowledge through blogging and podcasting. Driven by curiosity and a love for technology, I'm always eager to explore new tools and approaches, and I consider myself fortunate to work in a field I'm truly passionate about.",
    "location": {
      "city": "London",
      "region": "England",
      "countryCode": "GB"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "eddmann",
        "url": "https://github.com/eddmann"
      },
      {
        "network": "LinkedIn",
        "username": "eddmann",
        "url": "https://www.linkedin.com/in/eddmann/"
      },
      {
        "network": "X",
        "username": "edd_mann",
        "url": "https://x.com/edd_mann"
      },
      {
        "network": "Bluesky",
        "username": "eddmann.com",
        "url": "https://bsky.app/profile/eddmann.com"
      }
    ]
  },
  "work": [
    {
      "name": "Instapro",
      "position": "Tech Lead",
      "url": "https://careers.instapro.group/",
      "startDate": "2022",
      "endDate": "2025",
      "summary": "Transitioned to a Tech Lead role following the merger of MyBuilder with Instapro, gaining the opportunity to work within a larger organisation and help shape its technical direction. Led several key greenfield innovation projects, driving technical excellence and business impact.",
      "highlights": [
        "Led the development of a major retailer integration for the platform, facilitating event storming sessions to map requirements and collaborating closely with stakeholders throughout the design and rollout phases. Delivered the solution using React, TypeScript, PHP, and AWS Serverless technologies.",
        "Co-led the design and implementation of a core chat platform, architected as a micro-frontend, vertical-slice service. This platform, adopted by multiple stream-aligned teams, introduced a custom markup language and Slack-like behavioural capabilities to accelerate feature delivery and experimentation. Developed a 'Surface Builder' tool enabling internal teams to rapidly iterate on custom messages.",
        "Drove architectural decision-making and supported multiple teams (both stream-aligned and enabling platform teams) in breaking up the monolith. Guided teams in adopting vertical-slice ownership of services, designing around discovered subdomains and well-defined bounded contexts."
      ]
    },
    {
      "name": "MyBuilder",
      "position": "Software Engineer, Senior Software Engineer, Tech Lead",
      "url": "https://www.mybuilder.com/",
      "startDate": "2014",
      "endDate": "2022",
      "summary": "Progressed from Software Engineer to Tech Lead, working end-to-end across the stack: frontend (React, TypeScript), backend (PHP, Symfony), and infrastructure (AWS, Terraform, Serverless). Consistently delivered customer value by solving real-world business problems regardless of where in the stack, while applying modern engineering practices and deepening domain understanding.",
      "highlights": [
        "Key contributor to the successful acquisition by IAC in 2017 by developing and leading critical product features that drove business growth.",
        "Aided in the transition to a modular monolith architecture for the core marketplace - facilitating the discovery of subdomains and the design of robust bounded contexts.",
        "Led the migration from on-premises infrastructure to AWS, implementing Infrastructure as Code with Terraform and leveraging a wide range of AWS services.",
        "Architected and delivered a greenfield insurance application and underwriting system (MyBuilder Plus) using DDD, Event Sourcing, CQRS, Hexagonal Architecture, Terraform Cloud, and Serverless technologies.",
        "Collaborated closely with a colleague to iteratively migrate all services to a Serverless architecture (AWS Lambda) with minimal impact to the business.",
        "Modernised CI/CD pipelines by migrating all services to GitHub Actions, improving deployment speed and reliability.",
        "Developed internal developer tooling, including a CLI tool to streamline service discovery and local development across both monorepos and separate repositories, significantly boosting developer productivity.",
        "Rolled out architectural and infrastructure patterns proven in the insurance project across many services and projects organisation-wide.",
        "Designed and implemented a global event bus using AWS EventBridge to enable seamless communication between services and bounded contexts across both MyBuilder and MyBuilder Plus."
      ]
    },
    {
      "name": "360 Software Solutions",
      "position": "Web Developer",
      "url": "https://www.360ss.com/",
      "startDate": "2011",
      "endDate": "2013",
      "summary": "Worked closely with clients to deliver tailored web solutions, balancing greenfield and legacy projects in a fast-paced environment. Gained valuable experience in client communication, requirements gathering, and collaborative problem-solving while adapting to a diverse range of business needs.",
      "highlights": [
        "Designed and implemented a modular MVC PHP content management platform, enabling rapid and efficient client website development.",
        "Led the end-to-end development of a large-scale, web-based mobile search engine start-up, overseeing architecture and delivery.",
        "Developed and launched a cross-platform mobile application for iOS and Android using Titanium, expanding client reach."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Greenwich",
      "url": "https://www.gre.ac.uk/",
      "area": "Internet Computing",
      "studyType": "Bachelor of Science",
      "startDate": "2008",
      "endDate": "2011",
      "score": "First Class Honours"
    },
    {
      "institution": "West Kent College",
      "url": "https://www.northkent.ac.uk/",
      "area": "IT Practitioner",
      "studyType": "BTEC National Diploma",
      "startDate": "2005",
      "endDate": "2007",
      "score": "Distinction, Distinction, Merit"
    }
  ],
  "awards": [
    {
      "title": "School Prize for Outstanding Achievement (Computing)",
      "date": "2011",
      "awarder": "University of Greenwich",
      "url": "https://www.gre.ac.uk/",
      "summary": "Awarded the School Prize for Outstanding Achievement in the Undergraduate Computing programme, achieving 74%+ in every module across all three years."
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "keywords": [
        "PHP",
        "JavaScript",
        "TypeScript",
        "Python",
        "Rust",
        "Swift",
        "SQL"
      ]
    },
    {
      "name": "Frontend",
      "keywords": [
        "React",
        "Next.js",
        "Redux Toolkit",
        "Vite",
        "BEM",
        "Tailwind CSS",
        "Styled Components",
        "PWA (Service Workers, Workbox)",
        "WebAssembly"
      ]
    },
    {
      "name": "Backend",
      "keywords": ["Symfony", "Laravel"]
    },
    {
      "name": "Cloud & Infrastructure",
      "keywords": [
        "AWS",
        "Terraform",
        "Serverless Framework",
        "AWS Lambda",
        "S3",
        "EventBridge",
        "SQS",
        "SNS",
        "RDS",
        "ECS Fargate"
      ]
    },
    {
      "name": "Databases",
      "keywords": ["PostgreSQL", "MySQL", "Redis", "DynamoDB"]
    },
    {
      "name": "Architecture & Practices",
      "keywords": [
        "Domain-Driven Design",
        "Event Sourcing",
        "CQRS",
        "Hexagonal Architecture",
        "Event-driven Architecture",
        "Micro-frontends",
        "Microservices"
      ]
    },
    {
      "name": "Tooling & DevOps",
      "keywords": [
        "Git",
        "Unix",
        "Docker",
        "GitHub Actions",
        "Puppet",
        "Terraform Cloud"
      ]
    },
    {
      "name": "Testing & Monitoring",
      "keywords": [
        "Automated testing",
        "Continuous integration",
        "Continuous delivery",
        "AWS CloudWatch",
        "Datadog",
        "Grafana",
        "Sentry"
      ]
    }
  ],
  "projects": [
    {
      "name": "santa-lang",
      "url": "https://eddmann.com/santa-lang/",
      "description": "A functional, C-like programming language created specifically for solving Advent of Code puzzles. After tackling Advent of Code challenges in a variety of languages, I was inspired to combine the best concepts from each into santa-lang. I developed the tree-walking interpreter in both TypeScript and Rust, documenting my progress and design decisions on my website."
    },
    {
      "name": "MyPodcast",
      "url": "https://mypodcast.cloud/",
      "description": "A SaaS product that transforms your saved articles into narrated podcast episodes, delivered directly to your favorite podcast app on your schedule. MyPodcast serves as a practical testbed for exploring LLMs and text-to-speech technologies, utilizing both online models for text summarization/generation and local models for speech synthesis."
    },
    {
      "name": "Our Wedding Website",
      "url": "https://github.com/eddmann/our-wedding-website",
      "description": "A showcase application and infrastructure project demonstrating how Domain-Driven Design, Hexagonal Architecture, CQRS, and Event Sourcing can be applied to build robust systems. The project integrates Terraform for infrastructure-as-code and is deployed serverlessly. Built with PHP and Symfony, it features a comprehensive testing strategy and local development environment. This project has been used at both MyBuilder and Instapro to educate team members on core architectural concepts and patterns."
    },
    {
      "name": "Serverless Fargate",
      "url": "https://www.npmjs.com/package/serverless-fargate",
      "description": "A Serverless Framework plugin that enables the management of long-running Fargate ECS tasks. I developed this in my spare time to facilitate asynchronous projections in serverless environments. The plugin averages over 8,000 downloads per week on NPM."
    },
    {
      "name": "Chessmate",
      "url": "https://chessmate.cloud/",
      "description": "A multi-engine chess analysis app designed for deep exploration and smart move comparisons. Chessmate is a Progressive Web App offering both online (via AWS Lambda) and local (WASM-based) analysis. I also developed an iOS Swift application that wraps and exposes the PWA's core features, available in the App Store."
    },
    {
      "name": "Advent of Code",
      "url": "https://github.com/eddmann/advent-of-code/",
      "description": "I have participated in the Advent of Code challenge for several years, completing the full backlog of puzzles in multiple programming languages. This ongoing project provides a great opportunity to learn new languages and paradigms."
    }
  ],
  "interests": [
    {
      "name": "Podcasting",
      "keywords": [
        "Host of Compiled Conversations, an in-depth podcast featuring conversations with influential figures in software and technology.",
        "Co-hosted Three Devs and a Maybe (2013-2019), exploring a wide range of software development topics. The show evolved from a focus on web technologies to broader discussions, providing opportunities to learn from and connect with inspiring guests."
      ]
    },
    {
      "name": "Running",
      "keywords": [
        "Passionate runner, having completed over 20 marathons and an ultra marathon.",
        "Enthusiastic about early morning runs and consistently documenting my training and races on Strava."
      ]
    },
    {
      "name": "PCB Design",
      "keywords": [
        "Actively learning PCB design and development by building a custom Electronic Chessboard, leveraging Chessmate APIs as the backend."
      ]
    },
    {
      "name": "AI, Machine Learning, and Deep Learning",
      "keywords": [
        "Passionate about the intersection of AI and software development, and how intelligent systems can enhance the way we build and interact with software.",
        "Currently dedicating time to mastering core Machine Learning concepts through hands-on projects, such as developing predictive models for fantasy Formula 1 outcomes.",
        "Exploring Convolutional Neural Networks (CNNs) to train models that assist in determining chessboard state, enabling new features for the Chessmate app."
      ]
    }
  ],
  "references": [
    {
      "reference": "Available upon request"
    }
  ]
}
